import os
import hashlib
from typing import List
from langchain.schema import Document

from logging_config import setup_logging
from langchain.text_splitter import RecursiveCharacterTextSplitter
from langchain_community.document_loaders import TextLoader, DirectoryLoader
from langchain_community.embeddings import SentenceTransformerEmbeddings
from langchain_community.vectorstores import FAISS

logger = setup_logging()


def get_embeddings(model_name: str = "sentence-transformers/all-MiniLM-L6-v2"):
    return SentenceTransformerEmbeddings(model_name=model_name)


class RAGStore:
    def __init__(self,
                 vector_db_dir: str = "./agents/task_generator/vector_db",
                 knowledge_base_dir: str = "./agents/task_generator/c_knowledge_data",
                 embeddings_model: str = "sentence-transformers/all-MiniLM-L6-v2"
                 ):
        self.vector_db_dir = vector_db_dir
        self.knowledge_base_dir = knowledge_base_dir
        self.embeddings = get_embeddings(embeddings_model)
        os.makedirs(self.vector_db_dir, exist_ok=True)

    def _built_in_examples(self) -> List[Document]:
        """ Extended pack of built-in C programming examples in Russian """
        examples = {
            "1_1": """ТЕМА: Переменные и типы данных
СЛОЖНОСТЬ: Легкая

ЗАДАНИЕ:
Напишите программу, которая считывает два целых числа и выводит их сумму.

ВХОДНЫЕ ДАННЫЕ:
Два целых числа a и b (1 ≤ a, b ≤ 1000), записанные в одной строке через пробел

ВЫХОДНЫЕ ДАННЫЕ:
Одно число - сумма a и b

ПРИМЕР:
Вход:
5 3
Выход:
8

ПОДСКАЗКА:
Используйте scanf("%d %d", &a, &b) для ввода и printf("%d\\n", sum) для вывода.""",

            "1_2": """ТЕМА: Переменные и типы данных
СЛОЖНОСТЬ: Средняя

ЗАДАНИЕ:
Напишите программу, которая переводит температуру из градусов Цельсия в Фаренгейты. Формула: F = C * 9/5 + 32

ВХОДНЫЕ ДАННЫЕ:
Одно вещественное число C (-100.0 ≤ C ≤ 100.0)

ВЫХОДНЫЕ ДАННЫЕ:
Температура в Фаренгейтах с точностью до 1 знака после запятой

ПРИМЕР:
Вход:
25.0
Выход:
77.0

ПОДСКАЗКА:
Используйте тип double и спецификатор %.1f для вывода.""",

            "1_3": """ТЕМА: Переменные и типы данных
СЛОЖНОСТЬ: Сложная

ЗАДАНИЕ:
Напишите программу, которая считывает диаметр круга и вычисляет его площадь и периметр. Используйте значение π = 3.14159

ВХОДНЫЕ ДАННЫЕ:
Одно вещественное число d (0.1 ≤ d ≤ 1000.0)

ВЫХОДНЫЕ ДАННЫЕ:
Две вещественные числа - площадь и периметр через пробел, с 2 знаками после запятой

ПРИМЕР:
Вход:
10.0
Выход:
78.54 31.42

ПОДСКАЗКА:
Площадь = π*r², периметр = π*d. Помните, что r = d/2.""",

            "4_1": """ТЕМА: Массивы
СЛОЖНОСТЬ: Легкая

ЗАДАНИЕ:
Напишите программу, которая считывает массив из N целых чисел и находит максимальный элемент.

ВХОДНЫЕ ДАННЫЕ:
Первая строка: N (1 ≤ N ≤ 100)
Вторая строка: N целых чисел через пробел

ВЫХОДНЫЕ ДАННЫЕ:
Максимальное число из массива

ПРИМЕР:
Вход:
5
3 7 2 9 1
Выход:
9

ПОДСКАЗКА:
Инициализируйте максимум первым элементом массива, затем сравнивайте с остальными.""",

            "4_2": """ТЕМА: Массивы
СЛОЖНОСТЬ: Средняя

ЗАДАНИЕ:
Напишите программу, которая считывает массив целых чисел и подсчитывает количество элементов, больших среднего арифметического.

ВХОДНЫЕ ДАННЫЕ:
Первая строка: N (1 ≤ N ≤ 100)
Вторая строка: N целых чисел через пробел

ВЫХОДНЫЕ ДАННЫЕ:
Количество элементов больше среднего арифметического

ПРИМЕР:
Вход:
5
1 2 3 4 5
Выход:
2

ПОДСКАЗКА:
Сначала найдите среднее арифметическое, затем пересчитайте массив.""",

            "4_3": """ТЕМА: Массивы
СЛОЖНОСТЬ: Сложная

ЗАДАНИЕ:
Напишите программу, которая считывает два отсортированных массива и объединяет их в один отсортированный массив без дубликатов.

ВХОДНЫЕ ДАННЫЕ:
Первая строка: N (1 ≤ N ≤ 50)
Вторая строка: N отсортированных целых чисел
Третья строка: M (1 ≤ M ≤ 50)
Четвёртая строка: M отсортированных целых чисел

ВЫХОДНЫЕ ДАННЫЕ:
Одна отсортированная последовательность (без дубликатов) через пробел

ПРИМЕР:
Вход:
3
1 3 5
3
2 3 6
Выход:
1 2 3 5 6

ПОДСКАЗКА:
Используйте двухуказательный подход (two pointers) для слияния.""",

            "6_1": """ТЕМА: Указатели
СЛОЖНОСТЬ: Легкая

ЗАДАНИЕ:
Напишите программу с функцией, которая меняет местами значения двух целых переменных, используя указатели.

ВХОДНЫЕ ДАННЫЕ:
Два целых числа a и b

ВЫХОДНЫЕ ДАННЫЕ:
Значения a и b после обмена

ПРИМЕР:
Вход:
10 20
Выход:
20 10

ПОДСКАЗКА:
Создайте функцию swap(int *x, int *y) и используйте временную переменную.""",

            "5_1": """ТЕМА: Функции
СЛОЖНОСТЬ: Легкая

ЗАДАНИЕ:
Напишите программу с функцией factorial(int n), которая вычисляет факториал числа n.

ВХОДНЫЕ ДАННЫЕ:
Одно целое число n (0 ≤ n ≤ 10)

ВЫХОДНЫЕ ДАННЫЕ:
Факториал числа n

ПРИМЕР:
Вход:
5
Выход:
120

ПОДСКАЗКА:
Факториал n! = n * (n-1) * ... * 2 * 1. Учтите, что 0! = 1."""
        }

        docs = []
        for key, content in examples.items():
            topic_id, difficulty = key.split('_')
            doc = Document(
                page_content=content,
                metadata={
                    'source': f'built_in_example_{key}',
                    'type': 'task_example',
                    'topic_id': topic_id,
                    'difficulty': int(difficulty),
                    'language': 'russian'
                }
            )
            docs.append(doc)

        return docs

    def _load_external(self) -> List[Document]:
        """ Load external markdown files from the knowledge base directory """
        if not os.path.exists(self.knowledge_base_dir):
            return []

        try:
            loader = DirectoryLoader(
                self.knowledge_base_dir,
                glob="**/*.md",
                loader_cls=TextLoader,
                loader_kwargs={'encoding': 'utf-8'}
            )
            loaded = loader.load()
            for d in loaded:
                d.metadata.setdefault('source', 'external')
                d.metadata['type'] = 'external_knowledge'
            return loaded
        except Exception as e:
            logger.info(f"⚠️ Ошибка загрузки внешних файлов: {e}")
            return []

    def _process_documents(self, documents: List[Document]) -> List[Document]:
        """ Process and split documents into chunks """
        # Specific separators for task documents
        text_splitter = RecursiveCharacterTextSplitter(
            chunk_size=1000,
            chunk_overlap=200,
            separators=["\n\nЗАДАНИЕ:", "\n\nПРИМЕР:", "\n\nПОДСКАЗКА:", "\n\n", "\n"]
        )

        processed = []
        for doc in documents:
            content_hash = hashlib.md5(doc.page_content.encode()).hexdigest()
            doc.metadata['content_hash'] = content_hash
            chunks = text_splitter.split_documents([doc])
            processed.extend(chunks)

        return processed

    def load_or_create(self, index_name: str = "task_generation_faiss"):
        """Load existing vector store or create a new one."""
        index_path = os.path.join(self.vector_db_dir, index_name)

        # Try to load existing vector store
        if os.path.exists(index_path):
            try:
                logger.info(f"📚 Загружаем существующую векторную базу из {index_path}...")
                return FAISS.load_local(
                    index_path,
                    self.embeddings,
                    allow_dangerous_deserialization=True
                )
            except Exception as e:
                logger.info(f"⚠️ Не удалось загрузить существующую базу: {e}")
                logger.info("🏗️ Создаем новую векторную базу...")

        # Create new vector store
        base_docs = self._built_in_examples()
        external_docs = self._load_external()
        all_docs = base_docs + external_docs

        processed = self._process_documents(all_docs)

        if not processed:
            logger.info("❌ Нет документов для создания векторной базы!")
            return None

        logger.info(f"📝 Обработано {len(processed)} документов")
        vs = FAISS.from_documents(processed, self.embeddings)

        os.makedirs(index_path, exist_ok=True)
        vs.save_local(index_path)
        logger.info(f"✅ Векторная база сохранена в {index_path}")

        return vs
